#include <iostream>
#include <math.h>
using namespace std;


int main()
{
	setlocale(LC_ALL, "Rus");

	int x_1, x_2, y_1, y_2, x_3, y_3;
	double a, b, c, p;
	cout << "Введите координаты первой точки: ";
	cin >> x_1 >> y_1;
	cout << "Введите координаты второй точки: ";
	cin >> x_2 >> y_2;
	cout << "Расстояние между этими точками равно: " << (double)sqrt((x_2 - x_1) * (x_2 - x_1) + (y_2 - y_1) * (y_2 - y_1)) << endl;
	cout << "Введите значение точки A: ";
	cin >> x_1;
	cout << "Введите значение точки B: ";
	cin >> x_2;
	cout << "Введите значение точки C: ";
	cin >> x_3;
	cout << "Длина отрезка AC равна: " << abs(x_1 - x_3) << endl;
	cout << "Длина отрезка BC равна: " << abs(x_2 - x_3) << endl;
	cout << "Сумма отрезков AC и BC равна: " << abs(x_1 - x_3) + abs(x_2 - x_3) << endl;
	cout << "Введите значение точки A: ";
	cin >> x_1;
	cout << "Введите значение точки B: ";
	cin >> x_2;
	cout << "Введите значение точки C: ";
	cin >> x_3;
	cout << "Длина отрезка AC равна: " << abs(x_1 - x_3) << endl;
	cout << "Длина отрезка BC равна: " << abs(x_2 - x_3) << endl;
	cout << "оизведение отрезков AC и BC равно: " << abs(x_1 - x_3) * abs(x_2 - x_3) << endl;
	cout << "Введите координаты вершин прямоугольника: ";
	cin >> x_1 >> y_1;
	cin >> x_2 >> y_2;
	cout << "Периметр прямоугольника равен: " << abs(x_1 - x_2) * 2 + abs(y_1 - y_2) * 2 << endl;
	cout << "Площадь прямоугольника равна: " << abs(x_1 - x_2) * abs(y_1 - y_2) << endl;
	cout << "Введите координаты вершин треугольника: ";
	cin >> x_1 >> y_1;
	cin >> x_2 >> y_2;
	cin >> x_3 >> y_3;
	a = (double)sqrt((x_2 - x_1) * (x_2 - x_1) + (y_2 - y_1) * (y_2 - y_1));
	b = (double)sqrt((x_2 - x_3) * (x_2 - x_3) + (y_2 - y_3) * (y_2 - y_3));
	c = (double)sqrt((x_3 - x_1) * (x_3 - x_1) + (y_3 - y_1) * (y_3 - y_1));
	cout << "Периметр треугольника равен: " << a + b + c << endl;
	p = (a + b + c) / 2;
	cout << "Площадь треугольника равна: " << (double)sqrt(p * (p - a) * (p - b) * (p - c));
}