#include <iostream>
using namespace std;

int main()
{

	setlocale(LC_ALL, "Rus");

	int a, B ,B1, B2, A1, A2, C1, C2, X, A, Y, V_1, V_2, S, T, V, SS, y, x;
	cout << "Введите значение угла a: ";
	cin >> a;
	cout << "Значение угла в радианах: " << (a * 3.14) / 180 << endl;
	cout << "Введите значение угла a в радианах: ";
	cin >> a;
	cout << "Значение угла в градусах: " << (a * 180) / 3.14 << endl;
	cout << "Введите значение X(кг): ";
	cin >> X;
	cout << "Введите значение A(руб): ";
	cin >> A;
	cout << "Введите значение Y(кг): ";
	cin >> Y;
	cout << "1 кг конфет стоит: " << A / X << "рублей" << endl;
	cout << "Y кг конфет стоит: " << (Y * A) / X << endl;
	cout << "Введите скорость первого автомобиля: ";
	cin >> V_1;
	cout << "Введите скорость второго автомобиля: ";
	cin >> V_2;
	cout << "Введите расстояние между автомобилями: ";
	cin >> S;
	cout << "Введите значение времени: ";
	cin >> T;
	V = V_1 + V_2;
	SS = V * T + S;
	cout << "расстояние между автомобилями через T часов будет равно: " << SS << endl;
	cout << "Решить ур-е вида: Ax + B = 0" << endl;
	cout << "Введите A: ";
	cin >> A;
	cout << "Введите B: ";
	cin >> B;
	cout << "x равен: " << -B / A << endl;
	cout << "Введите значение A1: ";
	cin >> A1;
	cout << "Введите значение A2: ";
	cin >> A2;
	cout << "Введите значение B1: ";
	cin >> B1;
	cout << "Введите значение B2: ";
	cin >> B2;
	cout << "Введите значение C1: ";
	cin >> C1;
	cout << "Введите значение C2: ";
	cin >> C2;
	y = (C2 * A1 - A2 * C1) / (A1 * B2 - A2 * B1);
	x = (C1 - B1 * y) / A1;
	cout << "Ответом системы будет: (" << x << "," << y << ")" << endl;



















}